---
kind: method
id: M:Autodesk.Revit.DB.EdgeArray.Insert(Autodesk.Revit.DB.Edge,System.Int32)
source: html/350234e1-4f7b-acea-6e20-09e045e538e2.htm
---
# Autodesk.Revit.DB.EdgeArray.Insert Method

Insert the specified edge into the array.

## Syntax (C#)
```csharp
public virtual void Insert(
	Edge item,
	int index
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Edge`) - The edge to be inserted into the array.
- **index** (`System.Int32`) - The edge will be inserted before this index.

## Returns
Returns whether the edge was inserted into the array.